// import { Input } from "antd";
import React, { useState } from "react";
import { StyledContainer } from "./style";
import Input from "../../../components/uiKit/input";
import InpotMessage from "../Input-message";
function ListMessage(props) {
    const [news, setnews] = useState([
        {
            userType:1,
            id: 1,
            text: `متاورس" زندگی آینده ما را شکل می‌دهد و با وجود اینکه شاید به دلیل نداشتن شناخت کافی از آن ترسناک به نظر برسد اما پذیرفتن آن اجتناب‌ناپذیر است.`,
            title: " پیمانکار اول ",
            tags: ["مقاله"],
            minute: 6,
            date: "۰۸ دی ۱۴۰۰",
        },
        {
            userType:1,
            id: 2,
            text: `متاورس" زندگی آینده ما را شکل می‌دهد و با وجود اینکه شاید به دلیل نداشتن شناخت کافی از آن ترسناک به نظر برسد اما پذیرفتن آن اجتناب‌ناپذیر است.`,
            title: "محمد",
            tags: ["طراحی لوگو"],
            minute: 6,
            date: "۰۸ دی ۱۴۰۰",
        },
        {
            userType:2,
            id: 4,
            text: `متاورس" زندگی آینده ما را شکل می‌دهد و با وجود اینکه شاید به دلیل نداشتن شناخت کافی از آن ترسناک به نظر برسد اما پذیرفتن آن اجتناب‌ناپذیر است.`,
            title: "کاظم",
            tags: ["روابط عمومی"],
            minute: 6,
            date: "۰۸ دی ۱۴۰۰",
        },
        {
            userType:1,
            id: 4,
            text: `متاورس" زندگی آینده ما را شکل می‌دهد و با وجود اینکه شاید به دلیل نداشتن شناخت کافی از آن ترسناک به نظر برسد اما پذیرفتن آن اجتناب‌ناپذیر است.`,
            title: `رسانه‌ها چگونه مخاطب را اقناع می‌کنند؟`,
            tags: ["رسانه های دیجیتال"],
            minute: 6,
            date: "۰۸ دی ۱۴۰۰",
        },
        {
            userType:2,
            id: 4,
            text: `متاورس" زندگی آینده ما را شکل می‌دهد و با وجود اینکه شاید به دلیل نداشتن شناخت کافی از آن ترسناک به نظر برسد اما پذیرفتن آن اجتناب‌ناپذیر است.`,
            title: `رسانه‌ها چگونه مخاطب را اقناع می‌کنند؟`,
            tags: ["رسانه های دیجیتال"],
            minute: 6,
            date: "۰۸ دی ۱۴۰۰",
        },
        {
            userType:1,
            id: 4,
            text: `متاورس" زندگی آینده ما را شکل می‌دهد و با وجود اینکه شاید به دلیل نداشتن شناخت کافی از آن ترسناک به نظر برسد اما پذیرفتن آن اجتناب‌ناپذیر است.`,
            title: `رسانه‌ها چگونه مخاطب را اقناع می‌کنند؟`,
            tags: ["رسانه های دیجیتال"],
            minute: 6,
            date: "۰۸ دی ۱۴۰۰",
        },
        {
            userType:2,
            id: 4,
            text: `متاورس" زندگی آینده ما را شکل می‌دهد و با وجود اینکه شاید به دلیل نداشتن شناخت کافی از آن ترسناک به نظر برسد اما پذیرفتن آن اجتناب‌ناپذیر است.`,
            title: `رسانه‌ها چگونه مخاطب را اقناع می‌کنند؟`,
            tags: ["رسانه های دیجیتال"],
            minute: 6,
            date: "۰۸ دی ۱۴۰۰",
        },
        {
            userType:1,
            id: 4,
            text: `متاورس" زندگی آینده ما را شکل می‌دهد و با وجود اینکه شاید به دلیل نداشتن شناخت کافی از آن ترسناک به نظر برسد اما پذیرفتن آن اجتناب‌ناپذیر است.`,
            title: `رسانه‌ها چگونه مخاطب را اقناع می‌کنند؟`,
            tags: ["رسانه های دیجیتال"],
            minute: 6,
            date: "۰۸ دی ۱۴۰۰",
        },
        {
            userType:1,
            id: 4,
            text: `متاورس" زندگی آینده ما را شکل می‌دهد و با وجود اینکه شاید به دلیل نداشتن شناخت کافی از آن ترسناک به نظر برسد اما پذیرفتن آن اجتناب‌ناپذیر است.`,
            title: `رسانه‌ها چگونه مخاطب را اقناع می‌کنند؟`,
            tags: ["رسانه های دیجیتال"],
            minute: 6,
            date: "۰۸ دی ۱۴۰۰",
        },
        {
            userType:1,
            id: 4,
            text: `متاورس" زندگی آینده ما را شکل می‌دهد و با وجود اینکه شاید به دلیل نداشتن شناخت کافی از آن ترسناک به نظر برسد اما پذیرفتن آن اجتناب‌ناپذیر است.`,
            title: `رسانه‌ها چگونه مخاطب را اقناع می‌کنند؟`,
            tags: ["رسانه های دیجیتال"],
            minute: 6,
            date: "۰۸ دی ۱۴۰۰",
        },
    ]);
    return (
        <StyledContainer>

            <div className="messageList">
                {news.map((item, index) => {
                    return (
                        <div key={index} className={`messages ${item.userType==1?'user_user':'admin_user'}` } >
                            <p>{item.text}</p>
                            <span className="date">
                                {item.date}
                            </span>
                        </div>
                    )
                })}
            </div>
            <div className="inpotMessageComponent">
                <InpotMessage  />
            </div>
        </StyledContainer>
    );
}

export default ListMessage;
